## Selecting columns 5: Transforming and adding multiple columns
By the end of this lesson you will be able to:
- transform multiple columns in-place
- add multiple columns
- transform and add multiple columns is less verbose ways

In [1]:
import polars as pl
import polars.selectors as cs

In [2]:
csv_file = "data_titanic.csv"

In [3]:
df = pl.read_csv(csv_file)
df.head(3)

shape: (3, 12)
┌─────────────┬──────────┬────────┬───────────────────┬───┬───────────┬─────────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name              ┆ … ┆ Ticket    ┆ Fare    ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---               ┆   ┆ ---       ┆ ---     ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str               ┆   ┆ str       ┆ f64     ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪═══════════════════╪═══╪═══════════╪═════════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen  ┆ … ┆ A/5 21171 ┆ 7.25    ┆ null  ┆ S        │
│             ┆          ┆        ┆ Harris            ┆   ┆           ┆         ┆       ┆          │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs.     ┆ … ┆ PC 17599  ┆ 71.2833 ┆ C85   ┆ C        │
│             ┆          ┆        ┆ John Bradley      ┆   ┆           ┆         ┆       ┆          │
│             ┆          ┆        ┆ (Flor…            ┆   ┆           ┆         ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss.  ┆ … ┆ STON/O2.  ┆ 7.925   ┆ null  ┆ S        │
│             ┆          ┆        ┆ Laina             ┆   ┆ 3101282   ┆         ┆       ┆          │
└─────────────┴──────────┴────────┴───────────────────┴───┴───────────┴─────────┴───────┴──────────┘

## Transforming existing columns

We can transform multiple existing columns by either passing a `list` of expressions to `with_columns` or comma-separated expressions.

Here we pass comma-separated expressions to round the floating columns to 0 decimal places

In [4]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col('Age').round(0),
        pl.col('Fare').round(0),
    )
    .head(3)
)

shape: (3, 12)
┌─────────────┬──────────┬────────┬──────────────────────┬───┬───────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                 ┆ … ┆ Ticket    ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                  ┆   ┆ ---       ┆ ---  ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str                  ┆   ┆ str       ┆ f64  ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪══════════════════════╪═══╪═══════════╪══════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen     ┆ … ┆ A/5 21171 ┆ 7.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Harris               ┆   ┆           ┆      ┆       ┆          │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs. John   ┆ … ┆ PC 17599  ┆ 71.0 ┆ C85   ┆ C        │
│             ┆          ┆        ┆ Bradley (Flor…       ┆   ┆           ┆      ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss.     ┆ … ┆ STON/O2.  ┆ 8.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Laina                ┆   ┆ 3101282   ┆      ┆       ┆          │
└─────────────┴──────────┴────────┴──────────────────────┴───┴───────────┴──────┴───────┴──────────┘

We can make this less verbose, however.

As we are applying the same transformation to the `Age` and `Fare` columns we can pass them both to the same `pl.col` as comma-separated column names

In [5]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col('Age','Fare').round(0),
    )
    .head(5)
)

shape: (5, 12)
┌─────────────┬──────────┬────────┬──────────────────────┬───┬───────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                 ┆ … ┆ Ticket    ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                  ┆   ┆ ---       ┆ ---  ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str                  ┆   ┆ str       ┆ f64  ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪══════════════════════╪═══╪═══════════╪══════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen     ┆ … ┆ A/5 21171 ┆ 7.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Harris               ┆   ┆           ┆      ┆       ┆          │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs. John   ┆ … ┆ PC 17599  ┆ 71.0 ┆ C85   ┆ C        │
│             ┆          ┆        ┆ Bradley (Flor…       ┆   ┆           ┆      ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss.     ┆ … ┆ STON/O2.  ┆ 8.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Laina                ┆   ┆ 3101282   ┆      ┆       ┆          │
│ 4           ┆ 1        ┆ 1      ┆ Futrelle, Mrs.       ┆ … ┆ 113803    ┆ 53.0 ┆ C123  ┆ S        │
│             ┆          ┆        ┆ Jacques Heath (Li…   ┆   ┆           ┆      ┆       ┆          │
│ 5           ┆ 0        ┆ 3      ┆ Allen, Mr. William   ┆ … ┆ 373450    ┆ 8.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Henry                ┆   ┆           ┆      ┆       ┆          │
└─────────────┴──────────┴────────┴──────────────────────┴───┴───────────┴──────┴───────┴──────────┘

In this example `Age` and `Fare` are the only float columns. This means that we can instead pass their dtype to `pl.col` to apply the `round` expression to all float columns

In [6]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col(pl.Float64).round(0),
    )
    .head(3)
)

shape: (3, 12)
┌─────────────┬──────────┬────────┬──────────────────────┬───┬───────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                 ┆ … ┆ Ticket    ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                  ┆   ┆ ---       ┆ ---  ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str                  ┆   ┆ str       ┆ f64  ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪══════════════════════╪═══╪═══════════╪══════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen     ┆ … ┆ A/5 21171 ┆ 7.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Harris               ┆   ┆           ┆      ┆       ┆          │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs. John   ┆ … ┆ PC 17599  ┆ 71.0 ┆ C85   ┆ C        │
│             ┆          ┆        ┆ Bradley (Flor…       ┆   ┆           ┆      ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss.     ┆ … ┆ STON/O2.  ┆ 8.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Laina                ┆   ┆ 3101282   ┆      ┆       ┆          │
└─────────────┴──────────┴────────┴──────────────────────┴───┴───────────┴──────┴───────┴──────────┘

Or we can use selectors to select the columns that we want to round

In [7]:
(
    pl.read_csv(csv_file)
    .with_columns(
        cs.float().round(0),
    )
    .head(3)
)

shape: (3, 12)
┌─────────────┬──────────┬────────┬──────────────────────┬───┬───────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                 ┆ … ┆ Ticket    ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                  ┆   ┆ ---       ┆ ---  ┆ ---   ┆ ---      │
│ i64         ┆ i64      ┆ i64    ┆ str                  ┆   ┆ str       ┆ f64  ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪══════════════════════╪═══╪═══════════╪══════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen     ┆ … ┆ A/5 21171 ┆ 7.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Harris               ┆   ┆           ┆      ┆       ┆          │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs. John   ┆ … ┆ PC 17599  ┆ 71.0 ┆ C85   ┆ C        │
│             ┆          ┆        ┆ Bradley (Flor…       ┆   ┆           ┆      ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss.     ┆ … ┆ STON/O2.  ┆ 8.0  ┆ null  ┆ S        │
│             ┆          ┆        ┆ Laina                ┆   ┆ 3101282   ┆      ┆       ┆          │
└─────────────┴──────────┴────────┴──────────────────────┴───┴───────────┴──────┴───────┴──────────┘

## Adding new columns from existing columns
Above we overwrite the existing `Age` and `Fare` columns in the `with_columns` statements

We can instead create new columns from existing columns with `alias`. 

In this example we add the rounded `Age` and `Fare` as new columns

In [8]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col('Age').round(0).alias('Age_round'),
        pl.col('Fare').round(0).alias('Fare_round')
    )
    .select(
        'Age','Age_round','Fare','Fare_round',
    )
    .head(3)
)

shape: (3, 4)
┌──────┬───────────┬─────────┬────────────┐
│ Age  ┆ Age_round ┆ Fare    ┆ Fare_round │
│ ---  ┆ ---       ┆ ---     ┆ ---        │
│ f64  ┆ f64       ┆ f64     ┆ f64        │
╞══════╪═══════════╪═════════╪════════════╡
│ 22.0 ┆ 22.0      ┆ 7.25    ┆ 7.0        │
│ 38.0 ┆ 38.0      ┆ 71.2833 ┆ 71.0       │
│ 26.0 ┆ 26.0      ┆ 7.925   ┆ 8.0        │
└──────┴───────────┴─────────┴────────────┘

As an alternative to `alias` we can use comma-separated keyword assignments

In [9]:
(
    pl.read_csv(csv_file)
    .with_columns(
        Age_round = pl.col('Age').round(0),
        Fare_round = pl.col('Fare').round(0),
    )
    .select(
        'Age','Age_round','Fare','Fare_round',
    )
    .head(3)
)

shape: (3, 4)
┌──────┬───────────┬─────────┬────────────┐
│ Age  ┆ Age_round ┆ Fare    ┆ Fare_round │
│ ---  ┆ ---       ┆ ---     ┆ ---        │
│ f64  ┆ f64       ┆ f64     ┆ f64        │
╞══════╪═══════════╪═════════╪════════════╡
│ 22.0 ┆ 22.0      ┆ 7.25    ┆ 7.0        │
│ 38.0 ┆ 38.0      ┆ 71.2833 ┆ 71.0       │
│ 26.0 ┆ 26.0      ┆ 7.925   ┆ 8.0        │
└──────┴───────────┴─────────┴────────────┘

Note that if you mix the `alias` and keyword assignment approach in the same `with_columns` the keyword assignments must come after the `alias` expressions.

When should you use `alias` and when should you use the keyword approach?
- There is no performance difference between the `alias` and keyword approach
- You might find the keyword approach more readable in some cases
- You can use python variables inside an `alias` but not with keyword assignment

## Creating new columns when working with multiple expressions
We can still use the less verbose multi-expression approaches we saw above when we want to create new columns.

In this example we round the float columns as new columns by adding the `_round` using `name.suffix`

In [10]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col(pl.Float64).round(0).name.suffix("_round"),
    )
    .select(
        'Age','Age_round','Fare','Fare_round',
    )
    .head(3)
)

shape: (3, 4)
┌──────┬───────────┬─────────┬────────────┐
│ Age  ┆ Age_round ┆ Fare    ┆ Fare_round │
│ ---  ┆ ---       ┆ ---     ┆ ---        │
│ f64  ┆ f64       ┆ f64     ┆ f64        │
╞══════╪═══════════╪═════════╪════════════╡
│ 22.0 ┆ 22.0      ┆ 7.25    ┆ 7.0        │
│ 38.0 ┆ 38.0      ┆ 71.2833 ┆ 71.0       │
│ 26.0 ┆ 26.0      ┆ 7.925   ┆ 8.0        │
└──────┴───────────┴─────────┴────────────┘

Using `name.suffix` (or `name.prefix`) is particularly useful when doing aggregations on lots of columns in a `groupby.agg`, as we see later in the course.

## Exercises

In the exercises you will develop your understanding of:
- overwriting existing columns
- adding multiple columns
- transforming multiple columns based on dtype

## Exercise 1
Convert the 64-bit integer and float columns to their 32-bit equivalents

In [11]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col(pl.NUMERIC_DTYPES).cast(pl.Int32)
    ).head(10)
)

shape: (10, 12)
┌─────────────┬──────────┬────────┬──────────────────────┬───┬───────────┬──────┬───────┬──────────┐
│ PassengerId ┆ Survived ┆ Pclass ┆ Name                 ┆ … ┆ Ticket    ┆ Fare ┆ Cabin ┆ Embarked │
│ ---         ┆ ---      ┆ ---    ┆ ---                  ┆   ┆ ---       ┆ ---  ┆ ---   ┆ ---      │
│ i32         ┆ i32      ┆ i32    ┆ str                  ┆   ┆ str       ┆ i32  ┆ str   ┆ str      │
╞═════════════╪══════════╪════════╪══════════════════════╪═══╪═══════════╪══════╪═══════╪══════════╡
│ 1           ┆ 0        ┆ 3      ┆ Braund, Mr. Owen     ┆ … ┆ A/5 21171 ┆ 7    ┆ null  ┆ S        │
│             ┆          ┆        ┆ Harris               ┆   ┆           ┆      ┆       ┆          │
│ 2           ┆ 1        ┆ 1      ┆ Cumings, Mrs. John   ┆ … ┆ PC 17599  ┆ 71   ┆ C85   ┆ C        │
│             ┆          ┆        ┆ Bradley (Flor…       ┆   ┆           ┆      ┆       ┆          │
│ 3           ┆ 1        ┆ 3      ┆ Heikkinen, Miss.     ┆ … ┆ STON/O2.  ┆ 7    ┆ null  ┆ S        │
│             ┆          ┆        ┆ Laina                ┆   ┆ 3101282   ┆      ┆       ┆          │
│ 4           ┆ 1        ┆ 1      ┆ Futrelle, Mrs.       ┆ … ┆ 113803    ┆ 53   ┆ C123  ┆ S        │
│             ┆          ┆        ┆ Jacques Heath (Li…   ┆   ┆           ┆      ┆       ┆          │
│ 5           ┆ 0        ┆ 3      ┆ Allen, Mr. William   ┆ … ┆ 373450    ┆ 8    ┆ null  ┆ S        │
│             ┆          ┆        ┆ Henry                ┆   ┆           ┆      ┆       ┆          │
│ 6           ┆ 0        ┆ 3      ┆ Moran, Mr. James     ┆ … ┆ 330877    ┆ 8    ┆ null  ┆ Q        │
│ 7           ┆ 0        ┆ 1      ┆ McCarthy, Mr.        ┆ … ┆ 17463     ┆ 51   ┆ E46   ┆ S        │
│             ┆          ┆        ┆ Timothy J            ┆   ┆           ┆      ┆       ┆          │
│ 8           ┆ 0        ┆ 3      ┆ Palsson, Master.     ┆ … ┆ 349909    ┆ 21   ┆ null  ┆ S        │
│             ┆          ┆        ┆ Gosta Leonard        ┆   ┆           ┆      ┆       ┆          │
│ 9           ┆ 1        ┆ 3      ┆ Johnson, Mrs. Oscar  ┆ … ┆ 347742    ┆ 11   ┆ null  ┆ S        │
│             ┆          ┆        ┆ W (Elisabeth…        ┆   ┆           ┆      ┆       ┆          │
│ 10          ┆ 1        ┆ 2      ┆ Nasser, Mrs.         ┆ … ┆ 237736    ┆ 30   ┆ null  ┆ C        │
│             ┆          ┆        ┆ Nicholas (Adele Ach… ┆   ┆           ┆      ┆       ┆          │
└─────────────┴──────────┴────────┴──────────────────────┴───┴───────────┴──────┴───────┴──────────┘

Continue by adding 
- a `family_size` column as the sum of the siblings, parents and the passenger
- a Boolean `over_thirty` column showing if a passenger is aged 30 or over

Add these columns using keyword assignment

### Exercise 2
We have the following fictitious dataset with sales figures of bikes in different countries.

In [12]:
dfb = pl.read_parquet("data_bike_sales.parquet")
dfb.head()

shape: (5, 10)
┌────────────┬──────────┬──────────┬───────────┬───┬───────────┬────────────┬──────┬─────────┐
│ date       ┆ customer ┆ customer ┆ country   ┆ … ┆ unit cost ┆ unit price ┆ cost ┆ revenue │
│ ---        ┆ age      ┆ gender   ┆ ---       ┆   ┆ ---       ┆ ---        ┆ ---  ┆ ---     │
│ date       ┆ ---      ┆ ---      ┆ str       ┆   ┆ i64       ┆ i64        ┆ i64  ┆ i64     │
│            ┆ i64      ┆ str      ┆           ┆   ┆           ┆            ┆      ┆         │
╞════════════╪══════════╪══════════╪═══════════╪═══╪═══════════╪════════════╪══════╪═════════╡
│ 2013-01-28 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 1912      ┆ 3400       ┆ 1912 ┆ 2856    │
│ 2015-01-28 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 1912      ┆ 3400       ┆ 1912 ┆ 2856    │
│ 2013-07-22 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 1912      ┆ 3400       ┆ 1912 ┆ 2856    │
│ 2015-07-22 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 1912      ┆ 3400       ┆ 3824 ┆ 5712    │
│ 2013-12-25 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 1912      ┆ 3400       ┆ 1912 ┆ 2856    │
└────────────┴──────────┴──────────┴───────────┴───┴───────────┴────────────┴──────┴─────────┘

The monetary values are in the local currency but we want to compare them in US dollars. 

In order to do this we join the following `DataFrame` with the foreign-exchange rates to US dollars

In [13]:
fx_df = (
    pl.DataFrame(
        {
            "country":['Germany', 'Canada', 'Australia', 'United States', 'United Kingdom', 'France'],
            "fx_rate":[1.25,2.0,2.5,1.0,1.5,1.25]
        }
    )
)

dfb = (
    dfb
    .join(fx_df,on="country",how="left")
)
dfb.head()

shape: (5, 11)
┌────────────┬──────────────┬──────────┬───────────┬───┬────────────┬──────┬─────────┬─────────┐
│ date       ┆ customer age ┆ customer ┆ country   ┆ … ┆ unit price ┆ cost ┆ revenue ┆ fx_rate │
│ ---        ┆ ---          ┆ gender   ┆ ---       ┆   ┆ ---        ┆ ---  ┆ ---     ┆ ---     │
│ date       ┆ i64          ┆ ---      ┆ str       ┆   ┆ i64        ┆ i64  ┆ i64     ┆ f64     │
│            ┆              ┆ str      ┆           ┆   ┆            ┆      ┆         ┆         │
╞════════════╪══════════════╪══════════╪═══════════╪═══╪════════════╪══════╪═════════╪═════════╡
│ 2013-01-28 ┆ 31           ┆ M        ┆ Australia ┆ … ┆ 3400       ┆ 1912 ┆ 2856    ┆ 2.5     │
│ 2015-01-28 ┆ 31           ┆ M        ┆ Australia ┆ … ┆ 3400       ┆ 1912 ┆ 2856    ┆ 2.5     │
│ 2013-07-22 ┆ 31           ┆ M        ┆ Australia ┆ … ┆ 3400       ┆ 1912 ┆ 2856    ┆ 2.5     │
│ 2015-07-22 ┆ 31           ┆ M        ┆ Australia ┆ … ┆ 3400       ┆ 3824 ┆ 5712    ┆ 2.5     │
│ 2013-12-25 ┆ 31           ┆ M        ┆ Australia ┆ … ┆ 3400       ┆ 1912 ┆ 2856    ┆ 2.5     │
└────────────┴──────────────┴──────────┴───────────┴───┴────────────┴──────┴─────────┴─────────┘

We now have a column called `fx_rate`.

We learn more about `joins` later in the course
Convert the monetary columns to a float dtype. 

Note that the some column names have whitespace (I recommend printing them out)

In [15]:
dfb.columns

['date',
 'customer age',
 'customer gender',
 'country',
 'sub category',
 'order quantity',
 'unit cost',
 'unit price',
 'cost',
 'revenue',
 'fx_rate']

Do this conversion to float dtype in a single expression

In [21]:
(
    dfb
    .with_columns(
        pl.col('cost').cast(pl.Float64),
        (pl.col('cost')*pl.col('fx_rate')).alias('cost_usd'),
        pl.col('unit cost').cast(pl.Float64),
        (pl.col('unit cost')*pl.col('fx_rate')).alias('unit_cost_usd'),
        pl.col('unit price').cast(pl.Float64),
        (pl.col('unit price')*pl.col('fx_rate')).alias('unit_price_usd'),
        pl.col('revenue').cast(pl.Float64),
        (pl.col('revenue')*pl.col('fx_rate')).alias('revenue_usd'),

    )
    .head(10)
)

shape: (10, 15)
┌───────────┬───────────┬───────────┬───────────┬───┬──────────┬───────────┬───────────┬───────────┐
│ date      ┆ customer  ┆ customer  ┆ country   ┆ … ┆ cost_usd ┆ unit_cost ┆ unit_pric ┆ revenue_u │
│ ---       ┆ age       ┆ gender    ┆ ---       ┆   ┆ ---      ┆ _usd      ┆ e_usd     ┆ sd        │
│ date      ┆ ---       ┆ ---       ┆ str       ┆   ┆ f64      ┆ ---       ┆ ---       ┆ ---       │
│           ┆ i64       ┆ str       ┆           ┆   ┆          ┆ f64       ┆ f64       ┆ f64       │
╞═══════════╪═══════════╪═══════════╪═══════════╪═══╪══════════╪═══════════╪═══════════╪═══════════╡
│ 2013-01-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0   ┆ 4780.0    ┆ 8500.0    ┆ 7140.0    │
│ 8         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2015-01-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0   ┆ 4780.0    ┆ 8500.0    ┆ 7140.0    │
│ 8         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2013-07-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0   ┆ 4780.0    ┆ 8500.0    ┆ 7140.0    │
│ 2         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2015-07-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 9560.0   ┆ 4780.0    ┆ 8500.0    ┆ 14280.0   │
│ 2         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2013-12-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0   ┆ 4780.0    ┆ 8500.0    ┆ 7140.0    │
│ 5         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2015-12-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 14340.0  ┆ 4780.0    ┆ 8500.0    ┆ 21420.0   │
│ 5         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2014-02-1 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0   ┆ 4780.0    ┆ 8500.0    ┆ 7140.0    │
│ 3         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2016-02-1 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 9560.0   ┆ 4780.0    ┆ 8500.0    ┆ 14280.0   │
│ 3         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2013-07-0 ┆ 32        ┆ M         ┆ Australia ┆ … ┆ 4780.0   ┆ 4780.0    ┆ 8500.0    ┆ 6885.0    │
│ 4         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
│ 2015-07-0 ┆ 32        ┆ M         ┆ Australia ┆ … ┆ 4780.0   ┆ 4780.0    ┆ 8500.0    ┆ 6885.0    │
│ 4         ┆           ┆           ┆           ┆   ┆          ┆           ┆           ┆           │
└───────────┴───────────┴───────────┴───────────┴───┴──────────┴───────────┴───────────┴───────────┘

Continue by adding a new `with_columns` statement where for each monetary column we add a column that has the US Dollar equivlent amount. We do this conversion by multiplying the monetary columns by `fx_rate`.

- Select the monetary columns using `cs.matches`
- Add `"_usd"` to the new column name
- Ensure you enclose the conversion in `()` before renaming the expressions

## Solutions

### Solution to Exercise 1
Convert the 64-bit integer and float columns to their 32-bit equivalents

In [ ]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col(pl.Float64).cast(pl.Float32),
        pl.col(pl.Int64).cast(pl.Int32),
    )
    .head()
)

Continue by adding
- a `family_size` column as the sum of the siblings, parents and the passenger
- a Boolean `over_thirty` column showing if a passenger is aged 30 or over

Do this using keyword assignment

In [ ]:
(
    pl.read_csv(csv_file)
    .with_columns(
        pl.col(pl.Float64).cast(pl.Float32),
        pl.col(pl.Int64).cast(pl.Int32),
    )
    .with_columns(
        family_size = pl.col("SibSp")+pl.col("Parch")+1,
        over_thirty = pl.col("Age")>=30
    )
    .head()
)

### Solution to Exercise 2
We have the following fictitious dataset with sales figures of bikes in different countries.

In [ ]:
dfb = pl.read_parquet("../data/bike_sales.parquet")
dfb.head()

The monetary values are in the local currency but we want to compare them in US dollars. 

In order to do this we join the following `DataFrame` with the foreign-exchange rates to US dollars

In [ ]:
fx_df = (
    pl.DataFrame(
        {
            "country":['Germany', 'Canada', 'Australia', 'United States', 'United Kingdom', 'France'],
            "fx_rate":[1.25,2.0,2.5,1.0,1.5,1.25]
        }
    )
)

dfb = (
    dfb
    .join(fx_df,on="country",how="left")
)
dfb.head()

We now have a column called `fx_rate`.

We learn more about `joins` later in the course
Convert the monetary columns to a float dtype. 

Note that the some column names have whitespace (I recommend printing them out)

In [22]:
dfb.columns

['date',
 'customer age',
 'customer gender',
 'country',
 'sub category',
 'order quantity',
 'unit cost',
 'unit price',
 'cost',
 'revenue',
 'fx_rate']

Do this conversion to float dtype in a single expression

In [23]:
(
    dfb
    .with_columns(
        pl.col('unit cost','unit price','cost','revenue').cast(pl.Float64)
    )
    .head()
)

shape: (5, 11)
┌────────────┬──────────┬──────────┬───────────┬───┬────────────┬────────┬─────────┬─────────┐
│ date       ┆ customer ┆ customer ┆ country   ┆ … ┆ unit price ┆ cost   ┆ revenue ┆ fx_rate │
│ ---        ┆ age      ┆ gender   ┆ ---       ┆   ┆ ---        ┆ ---    ┆ ---     ┆ ---     │
│ date       ┆ ---      ┆ ---      ┆ str       ┆   ┆ f64        ┆ f64    ┆ f64     ┆ f64     │
│            ┆ i64      ┆ str      ┆           ┆   ┆            ┆        ┆         ┆         │
╞════════════╪══════════╪══════════╪═══════════╪═══╪════════════╪════════╪═════════╪═════════╡
│ 2013-01-28 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 3400.0     ┆ 1912.0 ┆ 2856.0  ┆ 2.5     │
│ 2015-01-28 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 3400.0     ┆ 1912.0 ┆ 2856.0  ┆ 2.5     │
│ 2013-07-22 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 3400.0     ┆ 1912.0 ┆ 2856.0  ┆ 2.5     │
│ 2015-07-22 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 3400.0     ┆ 3824.0 ┆ 5712.0  ┆ 2.5     │
│ 2013-12-25 ┆ 31       ┆ M        ┆ Australia ┆ … ┆ 3400.0     ┆ 1912.0 ┆ 2856.0  ┆ 2.5     │
└────────────┴──────────┴──────────┴───────────┴───┴────────────┴────────┴─────────┴─────────┘

Continue by adding a new `with_columns` statement where for each monetary column we add a column that has the US Dollar equivlent amount. We do this conversion by multiplying the monetary columns by `fx_rate`.

- Select the monetary columns using `cs.matches`
- Add `"_usd"` to the new column name
- Ensure you enclose the conversion in `()` before renaming the expressions

In [24]:
(
    dfb
    .with_columns(
        pl.col('unit cost','unit price','cost','revenue').cast(pl.Float64)
    )

    .with_columns(
        (cs.matches("cost|price|revenue")*pl.col("fx_rate")).name.suffix("_usd")
    )
    .head()
)

shape: (5, 15)
┌───────────┬───────────┬───────────┬───────────┬───┬───────────┬───────────┬──────────┬───────────┐
│ date      ┆ customer  ┆ customer  ┆ country   ┆ … ┆ unit      ┆ unit      ┆ cost_usd ┆ revenue_u │
│ ---       ┆ age       ┆ gender    ┆ ---       ┆   ┆ cost_usd  ┆ price_usd ┆ ---      ┆ sd        │
│ date      ┆ ---       ┆ ---       ┆ str       ┆   ┆ ---       ┆ ---       ┆ f64      ┆ ---       │
│           ┆ i64       ┆ str       ┆           ┆   ┆ f64       ┆ f64       ┆          ┆ f64       │
╞═══════════╪═══════════╪═══════════╪═══════════╪═══╪═══════════╪═══════════╪══════════╪═══════════╡
│ 2013-01-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0    ┆ 8500.0    ┆ 4780.0   ┆ 7140.0    │
│ 8         ┆           ┆           ┆           ┆   ┆           ┆           ┆          ┆           │
│ 2015-01-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0    ┆ 8500.0    ┆ 4780.0   ┆ 7140.0    │
│ 8         ┆           ┆           ┆           ┆   ┆           ┆           ┆          ┆           │
│ 2013-07-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0    ┆ 8500.0    ┆ 4780.0   ┆ 7140.0    │
│ 2         ┆           ┆           ┆           ┆   ┆           ┆           ┆          ┆           │
│ 2015-07-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0    ┆ 8500.0    ┆ 9560.0   ┆ 14280.0   │
│ 2         ┆           ┆           ┆           ┆   ┆           ┆           ┆          ┆           │
│ 2013-12-2 ┆ 31        ┆ M         ┆ Australia ┆ … ┆ 4780.0    ┆ 8500.0    ┆ 4780.0   ┆ 7140.0    │
│ 5         ┆           ┆           ┆           ┆   ┆           ┆           ┆          ┆           │
└───────────┴───────────┴───────────┴───────────┴───┴───────────┴───────────┴──────────┴───────────┘